

//-----------------------------------alert
// alert('Привіт ');
// alert('як ');
// alert('справи ');



//-----------------------------------confirm

// let data = confirm( 'чи все вам подобається?');
// if ( data)
//     alert('Привіт як справи ');
// else
// console.log( 'error' );

//-----------------------------------prompt
// 'як ваші справи?' - ----Перший---- текст як заголовок вікна
// 'НОРМ' - ----Другий---- текст одразу відображається у вікні


let some_user = prompt('як ваші справи?', 'НОРМ');
if (some_user == null) {
    alert('ви нічого не ввели, дайте будь ласка відповідь');
    some_user = prompt('як ваші справи?', 'НОРМ');
}
    console.log(some_user);


// let some_box = null;
// -------------  null --------- змінна без значення (пуста)